Revit 2027 API
Segment.RemoveSize Method
 Remove the existing MEPSize with this nominal diameter from the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSize(
	double nominalDiameter
)
Public Sub RemoveSize (
	nominalDiameter As Double
)
public:
void RemoveSize(
	double nominalDiameter
)
member RemoveSize :
        nominalDiameter : float -> unit
Parameters
nominalDiameter Double
 The nominal diameter of the size.
Exceptions
Exception | Condition
InvalidOperationException |  The last size of the segment cannot be removed.
Remarks
 Does nothing if there is no existing MEPSize with this nominal diameter.
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace